In [1]:
'''
pandas:-pandas is a powerful data analysis library doveloped on the top of numpy.
In pandas there are two types of data structures.
1.Series
2.DataFrame
Series:- Series is a class in pandas .The object of classn hold a one dimensional array.
DataFrame:- Dataframe is a class in pandas. the object of DataFrame class hold a two dimensional array.
'''

'\npandas:-pandas is a powerful data analysis library doveloped on the top of numpy.\nIn pandas there are two types of data structures.\n1.Series\n2.DataFrame\nSeries:- Series is a class in pandas .The object of classn hold a one dimensional array.\nDataFrame:- Dataframe is a class in pandas. the object of DataFrame class hold a two dimensional\xa0array.\n'

In [2]:
import numpy as np
import pandas as pd

In [3]:
arr=np.linspace(1,10,10)
print(arr)

[ 1.  2.  3.  4.  5.  6.  7.  8.  9. 10.]

In [4]:
print(arr.dtype)

float64

In [5]:
ser=pd.Series(arr)
print(ser)

0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5     6.0
6     7.0
7     8.0
8     9.0
9    10.0
dtype: float64

In [6]:
data={
    "EmpID":[1001,1002,1003,1004,1005],
    "EmpName":["Adil","Nitesh","Noman","Nishar","Mukesh"],
    "Salary":[9999.0,4000.0,5000.0,6000.0,7000.0]
}
df=pd.DataFrame(data)
df

   EmpID EmpName  Salary
0   1001    Adil  9999.0
1   1002  Nitesh  4000.0
2   1003   Noman  5000.0
3   1004  Nishar  6000.0
4   1005  Mukesh  7000.0

In [7]:
 # How to data into .csv file
df.to_csv("Emp.csv",index=False)

In [8]:
# Read.csv file
df2=pd.read_csv("student_info.csv")
df2

     study_hours  student_marks
0           6.83          78.50
1           6.56          76.74
2            NaN          78.68
3           5.67          71.82
4           8.67          84.19
..           ...            ...
195         7.53          81.67
196         8.56          84.68
197         8.94          86.75
198         6.60          78.05
199         8.35          83.50

[200 rows x 2 columns]

In [9]:
#head():-head() function in pandas DataFrame display top five rows.
df2.head(2)

   study_hours  student_marks
0         6.83          78.50
1         6.56          76.74

In [10]:
#tail():-tail() function in pandas DataFrame display last five rows.
df2.tail(2)

     study_hours  student_marks
198         6.60          78.05
199         8.35          83.50

In [11]:
df2.shape

(200, 2)

In [12]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   study_hours    195 non-null    float64
 1   student_marks  200 non-null    float64
dtypes: float64(2)
memory usage: 3.3 KB

In [13]:
df2.describe()

       study_hours  student_marks
count   195.000000      200.00000
mean      6.995949       77.93375
std       1.253060        4.92570
min       5.010000       68.57000
25%       5.775000       73.38500
50%       7.120000       77.71000
75%       8.085000       82.32000
max       8.990000       86.99000

In [14]:
df2.head()

   study_hours  student_marks
0         6.83          78.50
1         6.56          76.74
2          NaN          78.68
3         5.67          71.82
4         8.67          84.19

In [15]:
# Check missing values 
#df2.isnull().sum()

In [16]:
# how to drop rows with missing value
#df2.dropna(inplace=True)

In [17]:
#df2.isnull().sum()

In [19]:
df2.shape

(200, 2)

In [21]:
df2=df2.fillna(df2.mean())
df2.isnull().sum()

study_hours      0
student_marks    0
dtype: int64

In [22]:
df2.shape

(200, 2)